-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Jun 27, 2022 at 08:09 PM
-- Server version: 8.0.28
-- PHP Version: 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `plant world`
--

-- --------------------------------------------------------

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
CREATE TABLE IF NOT EXISTS `cart` (
  `cart_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `item_id` int NOT NULL,
  PRIMARY KEY (`cart_id`)
) ENGINE=InnoDB AUTO_INCREMENT=243 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
CREATE TABLE IF NOT EXISTS `product` (
  `item_id` int NOT NULL AUTO_INCREMENT,
  `item_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `item_name` varchar(255) NOT NULL,
  `item_price` double(10,2) NOT NULL,
  `item_image` varchar(255) NOT NULL,
  `item_description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`item_id`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`item_id`, `item_type`, `item_name`, `item_price`, `item_image`, `item_description`) VALUES
(1, 'Outdoor', 'Petunia', 10.00, './assets/products/Petunia.png', 'محبة للضوء دون التعرض لأشعة الشمس المباشرة، وتكون في كامل نشاطها عند درجة حرارة تصل إلى 22 درجة مئوية، لا تعرض النبتة للتفاوت المفاجئ في درجات الحرارة ولا للتيارات الهوائية خاصة خلال فترة الإزهار، جنبها مصادر البرودة مسا ء، احرص\r\n                    على تهوية مكانها جيدا دون التعرض للتيارات الهوائية. تروى عندما تكون تربتها شبه جافة فقط بمعدل رية واحدة في الأسبوع خلال وقت الإزهار أو كل عشرة أيام أثناء فترة النمو العادي بدون إزهار، وإن كان العامل المحدد لهذا هو درجات الحرارة\r\n                    المحيطة. لا تستخدم المياه المالحة، ولا تجعل الماء يتجمع في قاع الإناء الذي توضع فيه إذا كنت تضعها في إناء'),
(4, 'Outdoor', 'Gardenia Jasminoides', 20.00, './assets/products/Gardenia Jasminoides.png', 'وتعتبر التربة الحمضية هى سر\r\nنجاح زراعة شجرة الجاردينيا،\r\nوإذا كانت التربة غير حمضية\r\nيضاف عنصر الكبريت إليها\r\nلتغيير مستوى الرقم\r\nالهيدروجيني'),
(5, 'Outdoor', 'Calendula', 20.00, './assets/products/Calendula.png', 'الأزهار ذات أعناق طويلة\r\nصفراء أو برتقالية وجميع الالوان\r\nتقريبا منها المفرد ومنها المجوز\r\nيصلح للقطف يتكاثر بالبذور\r\nسواء بالأرض المستديمة مباشرة\r\nأو فى قصاري خارجي ة\r\nتحتاج للسمد شهري'),
(6, 'Outdoor', 'Jasminum officinale', 30.00, './assets/products/Jasminum officinale.png', 'الياسمين من المحاصيل\r\nالتي تحتاج الى كميات\r\nكبيرة من الأسمدة الكيماوية\r\nحيث يحتاج فدان الياسمين\r\nالى 700 كيلو جرام من\r\nسلفات النشادر , 250 كيلو\r\nجرام سلفات البوتاسيوم و\r\nتضاف هذه الكميات بعد\r\nعملية التقليم اي في شهر\r\nديسمبر او يناير .\r\nالسماد الآزوتي لا يضاف\r\nدفعة واحدة و إنما يتم\r\nإضافته على سبع دفعات\r\nمن شهر مارس و حتى\r\nشهر أكتوبر .\r\nالسماد البوتاسي يضاف\r\nأي ضا على ثلاث دفعات\r\nاول دفعة تضاف عند\r\nإضافة اول دفعة من السماد\r\nالآزوتي اما الدفعات الباقية\r\nفتضاف خلال شهري يونيو\r\nو أغسطس .\r\nيتم وضع السماد عن طريق\r\nدسه في التربة حول\r\nالشجيرات مع مراعاة أن لا\r\nيلمس السماد السيقان\r\nالرئيسية للنبات'),
(7, 'Outdoor', 'Ixora coccinea', 100.00, './assets/products/Ixora coccinea.png', 'محب للرطوبة خاصة وقت\r\nالصيف لذلك يرش برذاذ الماء،\r\nمحب للتربة الحامضية Ph5 ،\r\nيروى باعتدال وتزاد كمية الري\r\nصيفا . يفضل أن يكون في مكان\r\nنصف ظليل . السماد خاص\r\nللنباتات المحبة للتربة الملحية،\r\nويضاف البيتموس للتربة ويخلط\r\nمعها. وللتحكم بشكل وكثافة\r\nالإنبات يستحسن التقليم في\r\nفصل الربيع، يمكن أن يصاب\r\nبحشر ة المن أو الحشرات\r\nالقشرية أو البق الدقيقي ويكافح\r\nبالمبيدات الخاصة بذلك. كما\r\nيمكن زراعته في أص ص'),
(8, 'IndoorOutdoor', 'Jasminum sambac', 25.00, './assets/products/Jasminum sambac.png', 'نبتة تتحمل الظروف البيئية\r\nالمحلية من حرارة ورياح\r\nوجفاف لكنها لا تتحمل الملوحة\r\nيحتاج الفل إلى تربة خفيفة\r\nتصريفها جيد قريبة من التربة\r\nالرملية إلا أنها غنية بالمواد\r\nالعضوية. وبالنسبة للضوء،\r\nفالفل يفضل أشعة الشمس\r\nالمباشرة ولذلك يزدهر صيفا .\r\nأما الري فيروى جيد ا بالماء فهو\r\nمحب للماء بحيث تحافظ على\r\nرطوبة التربة ولا تغرق النبتة\r\nلأن ذلك يؤثر سلبا على نموها.\r\nومن ناحية السماد\r\nفيستخدم السماد العضوي\r\nالطبيعي خاصة إذا زرعت في\r\nأرض الحديقة ولا مانع من\r\nاستخدام السماد الكيماوي إذا\r\nكانت في أصص زراعي ة'),
(10, 'Indoor', 'Orchid Phalaenopsis', 300.00, './assets/products/Orchid Phalaenopsis.png', 'محبة للضوء دون التعرض لأشعة\r\nالشمس المباشرة، وتكون في\r\nكامل نشاطها عند درجة حرارة\r\n20 إلى 22 درجة مئوية، لا\r\nتعرض النبتة للتفاوت المفاجئ في\r\nدرجات الحرارة ولا للتيارات\r\nالهوائية خاصة خلال فترة\r\nالإزهار، جنبها مصادر البرودة\r\nمسا ء، احرص على تهوية مكانها\r\nجيدا دون التعرض للتيارات\r\nالهوائية. تروى عندما تكون\r\nتربتها شبه جافة فقط بمعدل رية\r\nواحدة في الأسبوع خلال وقت\r\nالإزهار أو كل عشرة أيام أثناء\r\nفترة النمو العادي بدون إزهار،\r\nوإن كان العامل المحدد لهذا هو\r\nدرجات الحرارة المحيطة. لا\r\nتستخدم المياه المالحة، ولا تجعل\r\nالماء يتجمع في قاع الإناء الذي\r\nتوضع فيه إذا كنت تضعها في\r\nإنا ء'),
(17, 'Indoor', 'vinca', 20.00, './assets/products/vinca.jpg', 'نبات الونكا عشبى صيفي تنجح زراعته فى الأماكن الظليله الأزهار ذات لون وردى أو أبيض أو بنفسجى و الساق خشبية الأوراق جلدية بيضية الشكل وهو نبات مقاوم للحشرات و يعد من النباتات سهلة التكاثر وتعتبر نبات سام لكن مصدر علاجي لأهم أنواع السرطانات و لعلاج الضغط و الربو السكري'),
(19, 'Indoor', 'Antirrhinum Majus', 100.00, './assets/products/Antirrhinum Majus.png', 'الموطن الأصلي لها المناطق الصخرية في أوروبا والولايات المتحدة، وشمال أفريقيا والمغرب العربي وتركيا وحوض البحر المتوسط تتكاثر نباتات حنك السبع جنسيا بواسطة البذور ونادرا جدا مايحدث التكاثر الخضري بواسة العقل الساقية لتلك النوع من النباتات تفضل نباتات حنك السبع التربة المسامية أي الجيدة التهوية والصرف'),
(20, 'IndoorOutdoor', 'Gazania', 20.00, './assets/products/Gazania.png', 'يتحمل الحرارة وكذلك الجفاف محب لضوء الشمس المباشر يفضل تقليمه تقليما جائرا بعد عدة سنوات لأنه يطرح أوراقه القديمة\r\nأو يزال ويستبدل بنبات جديد من النوع نفسه. مع تحمله للجفاف إلا أنه يجود مع انتظام الري، فيسقى مرتين يوميا في الصيف ومرة كل يومين خلال الشتاء كمعدل عام'),
(22, 'IndoorOutdoor', 'Begonia', 30.00, './assets/products/Begonia.png', 'يحتاج قصب البيجونيا إلى ضوء الشمس الساطع غير\r\nالمباشر، تفضل البيجونيا الجذرية وريكس البيجونيا مزيدا من الظل، أما إذا بدت الأوراق محترقة، يجب نقل\r\nالنبات إلى مكان أقل شمسا .استخدام سماد نباتي منزلي سائل وفق التعليمات العبوة كل أسبوعين سيشجع الأوراق والزهور الكبيرة'),
(23, 'IndoorOutdoor', 'Strelitzia reginae', 100.00, './assets/products/Strelitzia reginae.png', 'تحتاج ضوء ساطع داخل المنزل قريبا من النوافذ الكبيرة لتوفير الإضاءة الطبيعية مع عدم التعرض المباشر للشمس. لا يتم\r\nريها إلا بعد جفاف التربة جزئيا وعند جفاف سطح التربة مع عدم إغراقها بالماء. لا تحب الماء المصحوب بالشوائب والأملاح فهو يسبب لها اصفرار بالأوراق، لذا يفضل سقيها بماء مفلتر أو من ماء الصنبور العادي ولكن بعد تركه مكشوفا لمدة يوم حتى يتبخر منه الكلورين والفلورايد. قد\r\nتصفر أوراقها السفلية والسبب في هذا يعود لكثرة الري. أما قلة الري فتسبب لها الذبول وتجعد الأوراق. تحتاج إلى جو معتدل ويناسبها درجة حرارة الغرفة الطبيعية، وتتحمل الجو الدافئ حتى 30 درجة مئوية. رطوبة الجو المحيط بها مهمة لذلك ينصح بوضعها على صينية بها حصى مبلل أو رشها برذاذ الماء بشكل منتظم. يندر ما تزهر داخل البيوت إلا إذا توفرت لها البيئة المناسبة. تحتاج إلى غذاء أي سماد بشكل مستمر لأن نموها سريع، ويكون في فصلي الربيع والصيف فقط ومرة واحدة في الشهر. تسمد بسماد سائل متعدد الأغراض، ولا تسمد في الشتاء فترة السكون'),
(24, 'IndoorOutdoor', 'Dutch Rose', 70.00, './assets/products/Dutch Rose.png', 'نبتة محبة للبرودة 10 إلى 20 درجة مئوية، غير محب للرطوبة ولكن يفيده كثيرا رش الأوراق دون الأزهار برذاذ الماء ما بين فترة وأخرى، محب للضوء الساطع وأشعة الشمس المباشرة في غير فصل الصيف. الري\r\nوفير طوال العام عدا الشتاء. يسمد بانتظام خلال الصيف\r\nشهريا ، بسماد خاص لجنس\r\nالورد. ويعطى بالنسب الموضحة\r\nعلى العبوة. يخلط بالتربة بعيدا\r\nعن الساق بحوالي 12 سم. ويقلم\r\nالجوري القزمي خلال فصل\r\nالربيع بإزالة الأفرع الميتة وبعد\r\nانتهاء التزهير يفضل نقله للحديقة\r\nالخارجية في مكان يوفر له الظل\r\nالجزئي ولحمايته من التيارات\r\nالهوائية. أما في الصيف فالأفضل\r\nالاحتفاظ به داخل المنزل. من\r\nالأمراض التي قد تصيب النبات؛\r\nالبياض الدقيقي، والصدأ، والبقع\r\nالسوداء وهذه أمراض فطرية\r\nتكافح بالمبيد المناسب، كما يمكن\r\nأن تتعرض للعث العنكبوتي،\r\nوآكلات الأوراق من اليرقات،\r\nوكذلك المن، والحشرات القشرية،\r\nوتقاوم باستخدام مبيد حشري\r\nمناسب لكل منها'),
(25, 'IndoorOutdoor', 'Rosmarinus officinalis', 70.00, './assets/products/Rosmarinus officinalis.png', 'حتاج تربة جيدة التصريف،\r\nويمكن زراعته في أصص داخلية\r\nأو خارجية، مقاوم للجفاف، يفضل\r\nتقليم السويقات لتشجيع تكوي ن\r\nنموات جديدة تجعل النبات كثيف\r\nالنمو. يحفظ من الرياح القوية\r\nالجافة التي قد تؤدي إلى جفافه.\r\nمحب لضوء الشمس المباشر،\r\nينمو في مدى حراري واسع جدا\r\nيشمل المناطق الحارة والباردة،\r\nيروى بالماء مرتين يوميا خلال\r\nالصيف ومرة في اليوم خلال\r\nمعظم أيام السنة عدا الشتاء\r\nفيروى مرتين إلى ثلاث مرات\r\nفي الأسبوع وتختلف عملية الري\r\nباختلاف المناطق المناخية\r\nوحسب ما تراه من حال النبات\r\nومدى جودة نموه ولا يروى بمياه\r\nمالحة . يسمد مرة في السنة.\r\nيزهر إكليل الجبل في شهر مارس\r\nإلى مايو إذا توفرت له احتياجاته\r\nكاملة وبعد إتمام سنة من شتله\r\nوهذه ليست قاعدة'),
(26, 'IndoorOutdoor', 'Lavandula angustifolia', 100.00, './assets/products/Lavandula angustifolia.png', 'يمكن تقليمه لتشجيع تكوين فروع\r\nجديدة وللتحكم في حجمه حسب\r\nالرغبة، محب للرطوبة وينمو في\r\nالتربة الصخرية، ويروى بمياه\r\nقليلة الملوحة، يسمد مرة واحدة\r\nفي السنة على الأقل، يمكن\r\nاستخدامه لتغطية مساحات من\r\nالحدائق، أو لتحديد الحدائق أو\r\nلوضع سياج نب اتي منخفض'),
(27, 'Indoor', 'Cordyline Fruticose-Tango', 50.00, './assets/products/Cordyline Fruticose-Tango.png', 'سهل العناية ولا يتطلب الكثير من\r\nالجهد، هذا النوع من النبات مُحب\r\nللأجواء المعتدلة التي تتراوح بين\r\n25 – ° 20 ° درجة مئوية. وهو\r\nنبات لا يتحمل الجفاف ويتم تقليم\r\nأوراقه السفلية فور ملاحظة\r\nالجفاف. يُفضل أن يتم ريه يوم\r\nبعد يوم في فصل الصيف، ومرة\r\nواحدة كل أسبوع في فصل\r\nالشتاء. حتى تحافظ على جمالها\r\nوبريق أوراقها لا يكون الري من\r\nالأعلى، بل بقرب التربة عند بداية\r\nالساق. وهنالك سِر بسيط ومُفيد:\r\nلا تسقي نبات الكوردالين تانجو\r\nإلا عند جفاف سطح التربة.\r\nتُفضل نبتة الكوردالين تانجو تربة\r\nزراعية جيدة التصريف'),
(28, 'Indoor', 'Ocimum basilicum', 50.00, './assets/products/Ocimum basilicum.png', 'تقلم رؤوس الأفرع الطويلة\r\nللنبات حديث الغرس؛ كي ننشط\r\nنمو المجموع الجذري، وكذلك\r\nتقطع الزهور التي تظهر؛ كي\r\nنشجع النمو الخضري )الأفرع\r\nوالأوراق(. تنظف التربة من\r\nالأعشاب الضارة، وتسمد إلى\r\nثلاث مرات في السنة. والري\r\nيكون مرتين في اليوم صيفا\r\nومرة كل يومين شتا ء ويحكم\r\nعدد مرات الري مدى رطوبة\r\nالتربة حيث لا بد من بقائها\r\nرطبة'),
(29, 'Indoor', 'Cestrum Nocturnum', 80.00, './assets/products/Cestrum Nocturnum.png', 'تتحمل الظروف القاسية من\r\nحيث ارتفاع درجات الحرارة\r\n45 °م والرياح والجفاف إلى حد\r\nمعين ولكن ملكة الليل لا تتحمل\r\nالصقيع أو زيادة الملوحة . كما\r\nيمكن تقليمها لتأخذ شكلا حسب\r\nرغبة المرب ي'),
(30, 'IndoorOutdoor', 'Pelargonium', 80.00, './assets/products/Pelargonium.png', 'نبات خارجي في الأساس ولكن\r\nيمكن تربيته داخليا بشرط\r\nتعريضه لأشعة الشمس\r\nالمباشرة أول النهار صيفا أو\r\nوسط النهار شتا ء لفترة تقدر\r\nبأربع ساعات، وعلى الرغم من\r\nأنه خارجي لكنه في بيئتنا\r\nالصحراوية يحتاج إلى مكان\r\nمحمي من شمس الظهيرة\r\nالحارقة صيفا ، يتحمل جفاف\r\nالهواء وغير محب للرطوبة،\r\nالاعتدال في الري من الربيع\r\nإلى الخريف ويقلل في الشتاء،\r\nوتعطى النبتة السماد خلال نفس\r\nفترة الري على فترات منتظمة\r\nمرة في الشهر، تزال الأزهار\r\nالذابلة بانتظام وتقلم الأطراف\r\nالنامية للنباتات الصغيرة\r\nللحصول على نمو خضري\r\nكثيف يظهر النبات مكتنزا ، كما\r\nتقلم الأغصان الطويلة لتقصيرها\r\nخلال فصل الربيع، وذلك لأن\r\nسيقانها هشة قد تتكسر مع زيادة\r\nالطول'),
(31, 'Indoor', 'Mentha', 20.00, './assets/products/Mentha.png', '');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` varchar(280) NOT NULL,
  `first_name` varchar(100) NOT NULL,
  `last_name` varchar(100) NOT NULL,
  `Email` varchar(250) NOT NULL,
  `Password` varchar(250) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `user_id`, `first_name`, `last_name`, `Email`, `Password`) VALUES
(4, '135064', 'ahmed', 'kora', 'ahmedkora@gmil.com', '1234'),
(5, '74646425960053', 'kora', 'ahmed', 'koraahmed@gmail.com', '123'),
(6, '56763271', 'ahmed', 'salah', 'ahmed@gmail.com', 'ahmed');

-- --------------------------------------------------------

--
-- Table structure for table `wishlist`
--

DROP TABLE IF EXISTS `wishlist`;
CREATE TABLE IF NOT EXISTS `wishlist` (
  `cart_id` int NOT NULL,
  `user_id` int NOT NULL,
  `item_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
